package ex02;

public class Student {
	
	//----------------------------------필드-------------------------------------------//
	//레코드는 서로 다른 타입을 모아 둔것 
	//필드는 필드,메소드를 모아놓은것
	
	int num;
	String name;
	int jumsu;
	//--------------------------------------------------------------------------------//
	
	
	//------------------------Getter / Setter -----------------------------------------//
	
	//--------------------------------------------------------------------------------//
	
	
	//-----------------------------Constructor-----------------------------------------//
	
	public Student() {
		
		
		
	}
	
	//overloading 생성자 - 매개변수를 다르게 하는 여러가지 생성자 선언
	public Student(int num, String name, int jumsu) {
		//super();	//부모클래스의 생성자를 호출
					//부모클래스로부터 상속받은 필드,메소드를 자식클래스에서 사용하는 친구
		this.num = num;
		this.name = name;
		this.jumsu = jumsu;
	}

	@Override
	public String toString() {
		return "Student [num=" + num + ", name=" + name + ", jumsu=" + jumsu + "]";
	}
	
	//--------------------------------------------------------------------------------//
	
	
	//객체안의 기능은 메소드라고 표현(함수)
	
	


}
